{"data":{"jobs":{"edges":[{"node":{"frontmatter":{"title":"Machine Learning","tab":"DareData Engineering","company":"DareData Engineering","location":"Lisbon, Portugal","range":"June 2021 - Present","url":"https://daredata.engineering/"},"html":"<ul>\n<li>Planned and developed a proof of concept solution for a big utility company to create an automatic and interactive solution to calculate solar potential through satellite images. Implemented a computer vision pipeline using Pytorch and OpenCV to generate all the artefacts and data needed to integrate with the GIS-based systems.</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Machine Learning Engineer","tab":"Jungle","company":"Jungle","location":"Lisbon, Portugal","range":"May 2018 -  June 2021","url":"https://www.jungle.ai/"},"html":"<ul>\n<li>Researched and implemented Jungle’s core approach to predictive modelling with an emphasis on recurrent models and time series mainly using Pytorch.</li>\n<li>Active member of 5+ projects within the energy and heavy industry sector with the main purpose of showing Jungle’s predictive solutions.</li>\n<li>Designed, developed and build internal and production-ready software to meet product team and client requirements.</li>\n<li>Designed and implemented a database architecture (Postgres and TimescaleDB) refactor to allow for a scalable, high-performing and\ncost-effective solution.</li>\n<li>Built an automated data collection and cleaning pipeline (AWS S3 and Prefect) to update data daily.</li>\n<li>Built a CRUD RESTful API in Node.js for TimescaleDB and PostgresSQL database to be used by Jungle product.</li>\n<li>Implemented, deployed and maintained several high-performing, scalable and distributed workflows using Argo and Kubernetes to\ndifferent business needs.</li>\n<li>Designed, built and managed internal dashboards and data warehouse solutions using InfluxDB and Grafana to allow for high-volume data analysis.</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Master thesis internship","tab":"Master Thesis","company":"Jungle","location":"Lisbon, Portugal","range":"August 2017 - May 2018","url":"https://www.jungle.ai/"},"html":"<ul>\n<li>Had the opportunity to do my master thesis work in a professional environment. The main research goal was to study, implement\nand test the performance of different deep learning models and architectures applied to time-series problems, specifically in the\narea of predictive maintenance and forecasting. This allowed me to be an active member of Jungle’s daily projects to establish their\ntechnology.</li>\n</ul>"}}]}}}